//*=========== імпорт бібліотек ==================
// import Notiflix from 'notiflix';
// import axios from 'axios';
//*===========   ==============
// Хочете використовувати async/await? Додайте ключове слово `async` до зовнішньої функції/методу.
// async function getUser() {
//   try {
//     const response = await axios.get('/user?ID=12345');
//     console.log(response);
//   } catch (error) {
//     console.error(error);
//   }
// }
//*===========  ==============

//*===========  ==============

//*===========  ==============

//*===========  ==============

//*===========  ==============

//*===========  ==============
//*===========  ==============
//*===========  ==============
//*===========  ==============
//*===========  ==============
